* Thanks                                                        :programming:
** DONE have servant generate the javascript for the front-end api
   CLOSED: [2017-02-26 Sun 10:49]
** DONE Make a 'give thanks' component
   CLOSED: [2017-02-26 Sun 13:54]
** DONE try out bootstrap for thanks
   CLOSED: [2017-02-27 Mon 08:24]
   :LOGBOOK:
   CLOCK: [2017-02-27 Mon 07:22]--[2017-02-27 Mon 08:24] =>  1:02
   :END:
** DONE make it look decent on mobile
   CLOSED: [2017-02-27 Mon 09:02]
   :LOGBOOK:
   CLOCK: [2017-02-27 Mon 08:24]--[2017-02-27 Mon 09:02] =>  0:38
   :END:
** DONE fiddle with the layout until it is something I can appreciate.
   CLOSED: [2017-02-27 Mon 09:26]
** DONE Make the submit button stay on the same page but update the wall.
   CLOSED: [2017-02-27 Mon 09:30]
   CLOCK: [2017-02-27 Mon 09:08]--[2017-02-27 Mon 09:30] =>  0:22
   CLOCK: [2017-02-27 Mon 09:02]--[2017-02-27 Mon 09:04] =>  0:02
   :END:
** DONE fix the colors for Ali
   CLOSED: [2017-02-27 Mon 12:13]
   :LOGBOOK:
   CLOCK: [2017-02-27 Mon 11:39]--[2017-02-27 Mon 12:13] =>  0:34
   :END:
** DONE make something authentication-like
   CLOSED: [2017-02-27 Mon 18:19]
   :LOGBOOK:
   CLOCK: [2017-02-27 Mon 14:43]--[2017-02-27 Mon 17:43] =>  3:00
   CLOCK: [2017-02-27 Mon 10:35]--[2017-02-27 Mon 11:39] =>  1:04
   :END:
** DONE set up an account dashboard
   CLOSED: [2017-02-27 Mon 18:19]
   CLOCK: [2017-02-27 Mon 17:43]--[2017-02-27 Mon 18:19] =>  0:00
   :END:
** DONE set up a real login workflow by replacing the default one.
   CLOSED: [2017-02-28 Tue 23:29]
   :LOGBOOK:
   CLOCK: [2017-02-28 Tue 12:56]--[2017-02-28 Tue 22:18] =>  9:22
   :END:
** DONE set up confirmation emails
   CLOSED: [2017-03-01 Wed 02:56]
   :LOGBOOK:
   CLOCK: [2017-02-28 Tue 23:29]--[2017-03-01 Wed 02:56] =>  3:27
   :END:
** DONE set up a surefire way to make sure I am the admin
   CLOSED: [2017-03-03 Fri 01:34]
** DONE set up auto-backups of the database
   CLOSED: [2017-03-03 Fri 02:00]
** DONE fix the small thanks widget
   CLOSED: [2017-03-03 Fri 10:24]
** DONE fix the givethanks widget to be aware of logins.
   CLOSED: [2017-03-03 Fri 10:41]
** DONE fix the 'to' suggestions
   CLOSED: [2017-03-04 Sat 10:47]
** DONE add a 'delete' button for thanks.
   CLOSED: [2017-03-04 Sat 13:06]
** DONE test the 'to' suggestions in all cases:
   CLOSED: [2017-03-04 Sat 15:39]
- logged-in
- not logged-in

- email
- account
- abstract
- none of the above
** DONE add an option to generate a test database for messing around.
   CLOSED: [2017-03-05 Sun 17:20]
** DONE for a response from the hailgun maintainer
   CLOSED: [2017-03-09 Thu 11:50]
** CANCELLED highlight thanks from you or to you on the main page
   CLOSED: [2017-03-09 Thu 11:50]
** CANCELLED how to do emoji's?
   CLOSED: [2017-03-09 Thu 11:50]
** WAITING for the hailgun PR to come through
** WAITING for the persistent issue to be resolved.
** NEXT convert the auth system to https://hackage.haskell.org/package/yesod-auth-account
** TODO use dumber database types, no sum types for example. Just use a product of Maybe's
** TODO then put all the models in a 'models' directory (in seperate files) but let the TH concat those files
** TODO allow for manual verification of email address in the admin panel, in case the verification fails.
Make sure that the 'resend email' dialog has a link to a support page.
** TODO claim thanks when an account is registered with an email address that has been thanked.
** TODO send an email when someone has been thanked.
** TODO Rate-limit sending emails because of thankyou's to 1/second, maybe only send emails every day, instead of every time.

   
